import{_ as s}from"./Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.004-D-lAiJXD.js";import{_ as a}from"./Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.006-C6TVXSfy.js";import{_ as e}from"./Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.008-CELUo195.js";import{_ as o}from"./Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.010-DDUYNioq.js";import{_ as t}from"./Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.017-57kAEd1K.js";import{_ as r,c as i,a as p,o as c}from"./app-CUu1n7_5.js";const d="/parts-intellect-docs/assets/Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.167-BvgXsOYQ.png",b={};function g(f,n){return c(),i("div",null,n[0]||(n[0]=[p('<p>Справочник <strong>Автомобили</strong> содержит данные о машинах клиентов. Данная информация позволяет менеджерам корректно подбирать или проверять заказанные комплектующие на предмет соответствия машине клиента. В справочник заносятся автомобили, которые закрепляются за клиентами. В дальнейшем автомобили могут использоваться в <strong>Заказах клиента</strong>, <strong>VIN-запросах</strong> либо <strong>Заказ-Нарядах</strong>.</p><p>Данные о машинах добавляются:</p><ul><li><p>при формировании <strong>VIN-запроса</strong> с помощью формы <strong>Автомобиль</strong>;</p></li><li><p>командой <strong>Новый…</strong> в справочнике <strong>Автомобили</strong>;</p></li><li><p>в карточке контрагента на вкладке <strong>Автомобили</strong>;</p></li><li><p>при оформлении заказа в группе элементов <strong>Основные параметры</strong> поле <strong>Автомобиль</strong>.</p></li></ul><p><img src="'+d+'" alt=""></p><p><strong>Рабочая область</strong> включает следующие элементы:</p><p><img src="'+s+`" alt=""> <strong>Модификации</strong></p><pre><code>![](../../../assets/specification/Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.168.png)

Справочник позволяет быстро создать автомобиль по текущей модификации.  Для этого нужно нажать на необходимую модификацию и запомнить недостающую информацию в открывшейся карточке.

::: note Замечание

Справочник **Модификации** может быть заполнен вручную либо через меню **Управление ► Импорт данных ► Инициализация справочников, словарей и классификаторов**.

:::

На **Панели команд** доступно:

- ![](../../../assets/specification/Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.169.png)**обновить** - позволяет обновить данные в таблице;

- ![](../../../assets/specification/Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.170.png)**новый** - позволяет открыть инспектор создания новой модификации;

- ![](../../../assets/specification/Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.171.png)**править** - позволяет открыть инспектор выбранной модификации;

- ![](../../../assets/specification/Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.172.png)**удалить** - позволяет удалить выбранные модификации;

- ![](../../../assets/specification/Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.173.png)**копировать** - позволяет скопировать выбранную модификацию и открыть инспектор скопированной записи;

- ![](../../../assets/specification/Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.174.png)**импорт** - позволяет выполнить импорт в справочник;

- ![](../../../assets/specification/Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.175.png)**экспорт** - позволяет выполнить экспорт справочника;

- ![](../../../assets/specification/Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.176.png)**помощь** - позволяет открыть руководство пользователя по разделу.

В **Табличной части** доступны колонки:

- **Название –** наименование модификации;

- **Название Бренда –** марка автомобиля из справочника **Марки, модели**;

- **Название Модели –** модель автомобиля из справочника **Марки, модели** ;** 

- **Тип (буквы) двигателя –** тип двигателя автомобиля;

- **Начальный год выпуска** и **Начальный месяц выпуска –** год и месяц начала выпуска автомобиля;

- **Конечный год выпуска** и **Конечный месяц выпуска –** конечный год и месяц выпуска автомобиля;

- **Объем двигателя –** объем двигателя в см³;

- **Мощность, л.с. –** мощность двигателя в лошадиных силах;

- **Тип кузова –** тип кузова автомобиля;

- **Кол-во дверей –** количество дверей автомобиля;

- **Изображение –** признак наличия изображения в карточке модификации.
</code></pre><p><img src="`+a+`" alt=""> <strong>Фильтр по автомобилю</strong></p><pre><code>![](../../../assets/specification/Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.177.png)

Позволяет осуществить фильтрация автомобилей по следующим пунктам:

- **Марка** – отбор машин определенной марки;

- **Модель** – отбор по определенной модели;

- **Владелец автомобиля** – отбор машин, закрепленных за выбранным клиентом.

::: note Замечание

Фильтр **Владелец автомобиля** поддерживает ручной ввод и предварительную фильтрацию по введенным данным.

:::
</code></pre><p><img src="`+e+`" alt=""> <strong>Панель действий</strong></p><pre><code>![](../../../assets/specification/Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.178.png)

Позволяет осуществить [действия](#767ebf39-a9db-4efd-9067-efed7138ede6) над выбранными позициями.
</code></pre><p><img src="`+o+`" alt=""> <strong>Табличная часть</strong></p><pre><code>![](../../../assets/specification/Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.179.png)

Отображает информацию по автомобилям контрагентов.
</code></pre><p><img src="`+t+`" alt=""><strong>Владельцы автомобиля</strong></p><pre><code>![](../../../assets/specification/Aspose.Words.83ab1c44-6b28-430a-a5f2-4d9e6ba1abd4.180.png)

На форме **Владельцы автомобиля** перечислены контрагенты, к которым привязан выбранный автомобиль. 

::: note Замечание

Доступ к таблице **Владельцы автомобиля** определяется настройками в разделе **Управление** **► Настройки программы ► Роли пользователей ► Разрешения для роли пользователей ► Журналы ► Автомобили контрагентов**. 

:::

**Табличная часть** содержит колонки:

- **Контрагент** – наименование контрагента;

- **Контактный телефон** – контактный номер телефона контрагента;

- **Мобильный телефон** – мобильный номер телефона контрагента;

- **Рабочий телефон** – рабочий номер телефона контрагента;

- **Факс** – контактный номер факса контрагента;

- **Email** – электронная почта контрагента;

- **Дополнительные email-адреса** – дополнительные адреса электронной почты указанные в** карточке **Контрагента** на вкладке **Реквизиты**;

- **ИНН** – идентификационный номер налогоплательщика;

- **КПП** – номер КПП контрагента;

- **ОГРН** – основной государственный регистрационный номер контрагента;

- **ОКТМО** – номер общероссийского классификатора территорий муниципальных образований контрагента;

- **ЕГРН** – номер единого государственного реестра недвижимости контрагента;

- **ОКПО** – номер общероссийского классификатора предприятий и организаций контрагента;

- **ОКДП** – номер общероссийского классификатора видов экономической деятельности, продукции и услуг контрагента;

- **БИК** – банковский идентификационный код контрагента;

- **Номер свидетельства плательщика НДС** – номер свидетельства плательщика НДС контрагента.
</code></pre>`,15)]))}const v=r(b,[["render",g]]),h=JSON.parse('{"path":"/specification/crm/avtomobili/","title":"Автомобили","lang":"en-US","frontmatter":{"title":"Автомобили","createTime":"2025/04/21 20:02:51"},"headers":[],"readingTime":{"minutes":1.93,"words":580},"git":{"updatedTime":1745415005000,"contributors":[{"name":"a.lutoshkin","username":"","email":"a.lutoshkin@tradesoft.ru","commits":1,"avatar":"https://gravatar.com/avatar/605ee9d365e3a6380f8e9c71f9269ee5373d537aebefbece4e023cac396dfc8d?d=retro"}]},"filePathRelative":"specification/crm/avtomobili/README.md","categoryList":[{"id":"fd8b54","sort":10022,"name":"specification"},{"id":"2ac25b","sort":10064,"name":"crm"},{"id":"a384b0","sort":10066,"name":"avtomobili"}]}');export{v as comp,h as data};
